app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "Book was successfully created."
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("body", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["body", "a"], ["created_at", "2020-10-01 01:13:31.161447"], ["updated_at", "2020-10-01 01:13:31.161447"], ["title", "本のタイトル"]]
SELECT "books".* FROM "books"

  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "pangm"], ["body", "tc2uflvtnkuuhydtfdiv"], ["updated_at", "2020-10-01 08:55:03.225887"], ["id", 1]]